### Install MySql
    1. sudo apt update
    2. sudo apt upgrade
    3. sudo apt install mysql-server
    4. mysql --version
    
    Password
    1. sudo mysql -u root
    2. USE mysql;
    3. ALTER USER 'root'@'localhost' IDENTIFIED WITH mysql_native_password BY 'yourpass';

### connect

In [ ]:
sql = "sudo mysql -u root -p"

### Create new Dataset

In [ ]:
sql = "CREATE DATABASE database1"

### Switch to Database

In [ ]:
sql = "USE database1"

### Show all Datasets

In [6]:
sql = "SHOW DATABASES"

### Remove a Dataset

In [9]:
sql1 = "DROP DATABASE database1"

### Creating tables

In [8]:
sql = """
        CREATE TABLE Users(
        user_id int auto_increment,
        first_name varchar(255),
        last_name varchar(255) NOT NULL,
        age int,
        PRIMARY KEY (user_id)
        );
    """

In [ ]:
sql = """
        CREATE TABLE Orders(
        order_id int auto_increment,
        name varchar(255) NOT NULL,
        price int NOT NULL,
        user_id int NOT NULL,
        PRIMARY KEY (order_id),
        FOREIGN KEY (user_id) REFERENCES Users (user_id)
        );
    """

### Show Tables

In [12]:
sql = "SHOW TABLES;"

### Show fileds of a table

In [ ]:
sql = "show fields from Orders;"

### DROP TABLE

In [15]:
sql = "DROP TABLE Orders"

### Insert data

In [16]:
sql = "INSERT INTO Users (first_name, last_name, age) VALUES ('a', 'b', 12)"

In [19]:
sql = """
        INSERT INTO Orders (name, price, user_id)
        VALUES
        ('p1', 100, 1),
        ('p2', 200, 1),
        ('p3', 300, 2)
        
    """

### Select

In [22]:
sql = "SELECT * FROM Orders WHERE name = 'p2'"

In [24]:
sql = "SELECT * FROM Orders WHERE name LIKE 'p%'"

### Remove data

In [26]:
# DELETE FROM TABLE_NAME WHERE conditon
sql = "DELETE FROM Users WHERE user_id = 3"

In [27]:
sql = "DELETE FROM Orders WHERE name LIKE '%2%'"

### Update data

In [28]:
sql = "SELECT * FROM Orders"

In [30]:
sql = """UPDATE Orders SET 
            price = 0.1 * price + price
            WHERE price > 300
        """

### Example

In [ ]:
sql = """CREATE TABLE UserDetails (
    ID INT AUTO_INCREMENT PRIMARY KEY,
    UserName VARCHAR(255),
    Age INT,
    UserScore FLOAT,
    IsActive BOOL,
    RegistrationDate DATE
);
"""

In [ ]:
sql = """
    INSERT INTO UserDetails (UserName, Age, UserScore, IsActive, RegistrationDate) VALUES
    ('John Doe', 28, 85.5, TRUE, '2023-01-01'),
    ('Jane Smith', 32, 92.0, FALSE, '2023-01-02'),
    ('Emily Jones', 24, 78.9, TRUE, '2023-01-03');
    """

### AND, OR

In [ ]:
sql = """SELECT *
        FROM Orders
        WHERE name = 'Laptop' AND price > 1000;
    """

In [ ]:
sql = """SELECT *
        FROM Orders
        WHERE name = 'Laptop' OR name='Tablet';
    """

### Count, max, min, avg, sum

In [ ]:
sql = """
        SELECT COUNT(*) AS total_orders
        FROM Orders;
      """

In [ ]:
sql = """
       SELECT SUM(price) AS total_spent_on_laptops
        FROM Orders
        WHERE name = 'Laptop';
      """

In [ ]:
sql = """
        SELECT AVG(price) AS average_price_of_laptops
        FROM Orders
        WHERE name = 'Laptop';
      """

In [ ]:
sql = """
        SELECT MIN(price) AS lowest_price_for_laptop
        FROM Orders
        WHERE name = 'Laptop';
      """

### Join

### INNER JOIN

In [31]:
sql = """
        SELECT first_name, name FROM Orders INNER JOIN Users
        ON Orders.user_id = Users.user_id
    """

### LEFT JOIN

In [33]:
sql = """
        SELECT first_name, name FROM Users LEFT JOIN Orders 
        ON Orders.user_id = Users.user_id
    """

### RIGHT JOIN

In [35]:
sql = """
        SELECT first_name, name FROM Orders RIGHT JOIN Users
        ON Orders.user_id = Users.user_id
    """